"use client";

import Footer from "@/components/Footer";

export default function PrivacyPolicy() {
  return (
    <div className="bg-white px-4 min-h-screen flex flex-col items-center">
      <section className="text-center py-10 mt-20 privacy-policy">
        <div className="flex justify-center items-center mb-4">
          <span className="flex items-center gap-2 border border-[#FF2B77] text-primary text-sm font-medium px-4 py-1 rounded-full">
            <span className="w-2 h-2 bg-[#FF2B77] rounded-full"></span>
            الخصوصية
          </span>
        </div>

        {/* 🩷 العنوان الرئيسي */}
        <h2 className="text-2xl md:text-5xl font-semibold text-gray-800 flex justify-center items-center leading-snug">
          سياسة <span className="text-primary mr-2">الخصوصية</span>
          <img
            src="/icons/letter.svg"
            alt="letter"
            className="ml-2 w-6 h-6 relative top-[-5px]"
          />
        </h2>

        {/* ✨ الفقرة التعريفية */}
        <p className="text-[#888C92] max-w-3xl mx-auto mt-5 leading-relaxed text-[15px] md:text-[17px]">
          نحن في Yalla Cheese نولي أهمية كبيرة لحماية خصوصية بياناتك الشخصية،
          ونلتزم بالحفاظ على سرية المعلومات التي تزودنا بها عند استخدامك لموقعنا
          أو خدماتنا.
        </p>
      </section>
      <section className="bg-white text-secondary font-book text-[20px] ">
        <span>اتفاقية خصوصية المستخدم:</span>
        {/* نص الخصوصية */}
        <div className="space-y-6 text-[17px] leading-8">
          <p>
            تلتزم Yallacheese بحماية واحترام خصوصية المستخدم، حيث تصف هذه
            الاتفاقية بعض المعلومات التي يمكن للموقع أن يجمعها أو يطلبها من
            المستخدم عند دخوله للموقع الإلكتروني من خلال جهاز الحاسوب أو الهاتف
            الذكي، وتصف أيضًا كيفية استخدام هذه المعلومات الشخصية وحمايتها
            ومعاملتها بسرية تامة. توجب هذه الاتفاقية Yallacheese على تبليغ
            المستخدم طرق جمع معلوماته الشخصية، وهي من خلال خدمات الموقع
          </p>
          <span>
            {" "}
            لا تنطبق هذه الاتفاقية على أي معلومات يتم جمعها من المستخدم خارج
            نطاق خدمتنا باستخدام العناوين الإلكترونية الخارجية الموجودة على
            الموقع
          </span>

          <div>
            يوافق المستخدم على هذه الاتفاقية من خلال استخدامه وانتفاعه من الخدمة
            التي نقدمها، وللمستخدم حرية عدم الموافقة عليها بعدم استخدام الخدمات
            التي نقدمها
          </div>
          <div>
            <p> الرجاء قراءة المعلومات المدرجة في الأسفل:</p>
            <ul className="list-decimal list-inside space-y-2 pr-4">
              <li>المعلومات التي تجمعها Yallacheese من المستخدم.</li>
              <li>موقع تخزين معلومات المستخدم.</li>
              <li>كيفية استخدام الموقع لمعلومات المنتفع الشخصية.</li>
              <li>الإفصاح عن معلومات المستخدم الشخصية. </li>
              <li>تحديث وتصحيح وإلغاء المعلومات الشخصية للمستخدم. </li>
              <li> الخيارات المتعلقة بتحكم المستخدم بمعلوماته الشخصية.</li>
              <li> أمن وحماية المعلومات الشخصية للمستخدم.</li>
              <li> ملفات تعريف الارتباط.</li>
              <li>
                الروابط الخاصة بمواقع أخرى والإعلانات على موقع Yallacheese.
              </li>
              <li>التحديثات الحاصلة على اتفاقية خصوصية المستخدم.</li>
              <li>المنتديات وغرف المحادثة ورسائل الموقع.</li>
              <li> كيفية التواصل مع الموقع من أجل الاستفسارات.</li>
            </ul>
          </div>
          <p className="mt-8 mb-2">
            1. المعلومات التي يجمعها موقع YallaCheese من المستخدم:
          </p>
          <span>
            تقوم Yallacheese بجمع معلومات شخصية مختلفة للمستخدم وزوار الموقع
            المستخدمين لخدماتنا، ويمكن لنا جمعها مباشرة عن طريق إدخال المستخدم
            لمعلوماته الشخصية أو تلقائيًا أثناء تصفح واستخدام الموقع.
          </span>
          <ul className="list-decimal list-inside space-y-2 pr-4 mt-8">
            <li>
              <>معلومات المعرف الشخصي:</>
              <div>
                والتي يقصد بها المعلومات المعرفة بالمستخدم مثل الاسم والبريد
                الإلكتروني ومكان الدراسة، حيث يتم جمع هذه المعلومات وتحليلها عند
                التسجيل لاستخدام خدمتنا أو إنشاء حساب أو الانضمام لمجلتنا
                الدورية أو التواصل معنا. عند طلب المستخدم أحد منتجاتنا على
                الموقع، تطلب Yallacheese من المستخدم تزويدها بالمعلومات التي
                تتعلق بطرق الدفع التي ستستخدم في شراء منتجاتنا. يمكن للمستخدم
                توفير معلوماته من أجل نشرها وعرضها على مواقع أخرى (مثل المنتديات
                والمقالات والرسائل) أو نقلها لمستخدمين آخرين للموقع من خلال
                استخدام خاصية المشاركة (التحصيل ومساهمات المستخدم)، والتي تتم
                على مسؤولية المستخدم الشخصية. لا تستطيع Yallacheese التحكم
                بتصرفات وأفعال المستخدمين الآخرين للموقع الذين يقوم المستخدم
                بمشاركة معلوماته ومساهماته معهم. تكون بعض المعلومات التي يمكن
                للموقع طلبها من المستخدم أساسية أو طوعية بناءًا على طريقة
                استخدام المنتفع للموقع. لا يسمح للمستخدم بالمشاركة في أي نشاطات
                تطلب بعض المعلومات الأساسية، وذلك في حالة عدم توفير المنتفع من
                الخدمة لها. يمكن لYallacheese جمع المعلومات الشخصية الخاصة
                ببروتوكول الإنترنت الخاص بالمستخدم، وذلك للتعرف على المشاكل التي
                يمكن مواجهتها أثناء استخدام الموقع ومنتجاتنا، وأيضا لإدارة
                خدمتنا جيدًا وجمع المعلومات المتطلبة لتحسين الخدمة. تقوم
                Yallacheese فقط بجمع المعلومات الشخصية الضرورية للمعرف للاشتراك
                في النشاطات على موقعنا الإلكتروني.
              </div>
            </li>
            
            <li>
              <>معلومات المعرف غير الشخصي:</>
              <div>
                يمكن لYallacheese أو أحد شركائها جمع بعض المعلومات غير الشخصية والتي لا تعرف عن هوية شخص محدد، مثل المعلومات المتعلقة بأدوات المستخدم ونشاطات التصفح والمصادر التي يقوم المنتفع باستخدامها من خلال موقعنا، بالإضافة أيضًا إلى نوع نظام التشغيل والمتصفح الذي يستخدمه المنتفع. تقوم شركات الإعلانات الخاصة بنا بتزويدنا بملخصات وتقارير ليست شخصية عن عدد الإعلانات التي تم عرضها والضغط عليها على موقعنا، حيث أن تلك المعلومات التي تجمعها Yallacheese هي معلومات إحصائية في طبيعتها، تساعد في تقديم خدمة أفضل لمستخدمي الموقع، من خلال تعديل الخدمة المقدمة بناءً على اقتراحات المستخدم وتسريع أنماط الاستخدام والبحث.
              </div>
            </li>

            <li>
              <>المعلومات الخاصة بجهاز المستخدم:</>
              <div>
                تقوم Yallacheese بجمع معلومات جهاز المستخدم ونظام التشغيل عند استخدام خدماتنا، حيث تمكننا من معرفة النسخة المثالية للمنتج الذي نزوده للمستخدم. لا تطلب Yallacheese من المستخدم السماح لها بمتابعة موقعه أو الدخول لهاتفه الخاص في أي وقت خلال استخدامه للموقع والانتفاع من خدمتنا التي نقدمها.
              </div>
            </li>
          </ul>

          <p className="mt-8 mb-2">
            2. موقع تخزين معلومات المستخدم:
          </p>
          <div>
            تقوم Yallacheese بنقل وتخزين معلومات وبيانات المستخدم على أي خادم ملفات خاص بها، وستتخذ جميع النقاط والطرق الضرورية واللازمة لضمان وحماية معلومات المستخدم الشخصية بناءً على هذه الاتفاقية.
          </div>

          <p className="mt-8 mb-2">
            3. كيفية استخدام الموقع لمعلومات المنتفع الشخصية:
          </p>
          <div>
            تقوم Yallacheese باستخدام المعلومات الشخصية للمنتفع لديها من أجل ما يلي: ضمان وصول الخدمة للمستخدم بأفضل الطرق له ولجهازه الذي يستخدم خدمتنا من خلاله إن كان حاسوبًا أو هاتفًا ذكيًا. توفير المعلومات والخدمات والمنتجات التي يطلبها المستخدم من شركتنا أو التي تعتقد الشركة بأنها ستثير اهتمام المنتفع، والتي قام بالموافقة على أن تقوم الشركة بالتواصل معه بشأنها. تنفيذ واجباتنا الناشئة عن العقود المبرمة بين المستخدم وشركتنا، ومن ضمنها إعداد الفواتير والتحصيل. نقل معلومات المستخدم الخاصة بالدفع في حالة استخدام بطاقات الصراف الآلي لشركات مناسبة وموثوقة. السماح للمستخدم بالانخراط في أي نشاطات موجودة في خدمتنا عندما يشاء. تنويه المستخدم بأي تغييرات تحدث على الخدمة. بأي طريقة أخرى نذكرها عند توفير المستخدم لمعلوماته الشخصية.
          </div>

          <p className="mt-8 mb-2">
            4. الإفصاح عن معلومات المستخدم الشخصية:
          </p>
          <div>
            تضمن Yallacheese للمستخدم أن جميع المعلومات الشخصية به لدى الأطراف الأخرى تستخدم بالطرق التي تصفها هذه الاتفاقية، حيث أننا لا نقوم ببيع أو تأجير أو الافصاح عن معلومات المستخدم الشخصية لأحد إلا تلك المذكورة فيما يلي:
          </div>
          <ul className="list-disc list-inside space-y-2 pr-4 mt-4">
            <li>
              تقوم Yallacheese بتقديم بعض المعلومات لبعض مزودي الخدمة والأطراف الأخرى من خلال اتفاقيات موثقة بعقود قانونية، حيث تقوم Yallacheese ومزودو الخدمة الخاصة بها وشركائها باستخدام معلومات المنتفع الشخصية لإدارة موقعنا وتقديم خدماتنا، مثل تقديم بطاقة الصراف الآلي للبنك الخاص بالمستخدم من أجل تأكيد عمليات الدفع لمنتجاتنا وخدماتنا التي يطلبها المستخدم، أو توفير عنوان المستخدم لشركة التوصيل من أجل إيصال المنتج الذي تم شرائه من قبل المستخدم.
            </li>
            <li>
              ستقوم Yallacheese بالإفصاح عن المعلومات الشخصية للمنتفع في الظروف التالية: في حالة طلبها من قبل قوات الأمن أو السلطات القضائية أو الشركات التابعة للتحقيقات الأمنية. في حالة وجوب أو إيجاد دليل لدى الشركة على تقديم هذه المعلومات الشخصية للجهات الأمنية أو الإجراءات القانونية. للدفاع عن حقوقنا أو حقوق المستخدم. في حالة وجوب الافصاح عن المعلومات من أجل إجراءات مهنية إلزامية. لطرف ثالث في حالة موافقة المستخدم على ذلك. في حالة وجوب الإفصاح ومشاركة معلومات المستخدم الشخصية من أجل تدعيم وتطبيق أي اتفاقية بين المستخدم وشركة Yallacheese. تتضمن الاتفاقية أيضًا عملية تبادل المعلومات مع شركات أخرى بهدف الحماية من الاحتيال، وتقليل الخطورة على عملية استخدام البطاقات الإلكترونية.
            </li>
            <li>
              تحتفظ شركة Yallacheese بحق نقل المعلومات الشخصية المعرفة وغير المعرفة لشركة أخرى في حالة تم بيع بعض أسهم الشركة أو الشركة ككل لتلك الجهة أو المؤسسة.
            </li>
            <li>
              قد تقوم شركة Yallacheese بتقديم بعض المعلومات غير المعرفة عن مستخدميها مثل عمليات الشراء والتصفح وأي معلومات متعلقة بالموقع لشركات أخرى تعنى بالإعلانات. في حالة وجود أي استفسارات حول خصوصيات الاستخدام لدينا، يرجى التواصل مباشرة على البريد الإلكتروني contact@yallacheese.com.
            </li>
          </ul>

          <p className="mt-8 mb-2">
            5. تحديث وتصحيح وإلغاء المعلومات الشخصية للمستخدم:
          </p>
          <div>
            يمكن للمستخدم الوصول أو طلب حذف معلوماته الشخصية أو تعديلها على حسابه من خلال التواصل معنا على البريد الإلكتروني contact@yallacheese.com. في بعض الحالات لا يمكن حذف معلومات المستخدم الشخصية كاملة بسبب وجود النسخ الاحتياطية.
          </div>

          <p className="mt-8 mb-2">
            6. المعلومات المتعلقة بالبيانات التي يتم جمعها من خلال خادم موقع Yallacheese الإلكتروني:
          </p>
          <div>
            يقوم موقع Yallacheese بجمع المعلومات الشخصية للمستخدمين في بعض الحالات بناء على طلبهم مثل (شركة تقوم بالاشتراك في الخدمات من أجل استخدامها من قبل موظفي الشركة)، حيث في مثل هذه الحالة يصبح موقع Yallacheese محللا للمعلومات وليس له أي علاقة مباشرة بالعملاء التي يقوم بتحليل معلوماتهم الشخصية المعرفة، وفي حالة رغبة الأشخاص في الوصول وتعديل أو حذف تلك المعلومات يتوجب عليهم التواصل مع عميل الشركة. ستقوم Yallacheese بمعالجة طلبات العملاء خلال ثلاثين يوما من طلبهم، في حالة طلب إلغاء معلوماتهم الشخصية. يقوم موقع Yallacheese بالاحتفاظ المعلومات الشخصية المعرفة التي تقوم Yallacheese بمعالجتها نيابة عن عملاءنا بناء على المدة التي نحتاجها من أجل تقديم خدماتنا لعملاءنا، ولنا حق استخدام تلك المعلومات في المطالبة بحقوقنا القانونية وحل النزاعات Yallacheeseعيم اتفاقياتنا.
          </div>

          <p className="mt-8 mb-2">
            7. أمن وحماية المعلومات الشخصية للمستخدم:
          </p>
          <div>
            تقوم شركة Yallacheese بتخزين كافة المعلومات الشخصية التي يزودنا بها عملاءنا على خوادم ذات حماية عالية، وأي عمليات دفع إلكترونية ستكون مشفرة باستخدام تكنولوجيا آمنة تدعى (SSL). من أجل القيام بعمليات دفع إلكترونية آمنة، يتوجب على العميل استخدام متصفح يدعم تكنولوجيا (SSL) من حماية سرية معلوماته الشخصية وبطاقة الدفع الإلكترونية الخاصة به خلال إجراء العملية على الشبكة العنكبوتية.
          </div>
          <div className="mt-4">
            يستطيع عميلنا الوصول لحسابه الشخصي من خلال اسم مستخدم وكلمة سر تكون مشفرة من اختياره، وتقوم Yallacheese بحث العميل على عدم مشاركة كلمة السر الخاصة به مع أحد، وأن يقوم بتغير كلمة السر الخاصة به بشكل دوري باستخدام الحروف والأرقام وأن يقوم باستخدام متصفح آمن. لا يمكن أن يقوم العميل بتحميل المسؤولية لشركة Yallacheese عن أي اختراقات أمنية تحدث بسبب إهمال المنتفع في حماية اسم المستخدم وكلمة السر الخاصتين به، ويتوجب عليه دائما تسجيل الخروج من الموقع بعد الانتهاء في حالة مشاركته لجهازه مع شخص آخر، وذلك من أجل حماية معلوماته الشخصية.
          </div>
          <div className="mt-4">
            الرجاء التواصل معنا في حالة حدوث أي اختراقات أمنية تعنى بكلمة السر واسم المستخدم من أجل المساعدة على الأرقام التالية: 0792080441 أو مراسلتنا على البريد contact@yallacheese.com.
          </div>
          <div className="mt-4">
            بسبب عدم وجود ضمان كامل لعملية نقل المعلومات على الشبكة العنكبوتية أو أي شبكة لاسلكية أخرى، يعترف العميل أثناء محاولتنا حماية معلوماته الشخصية بشتى الطرق المتاحة من قبلنا بما يلي:
          </div>
          <ul className="list-disc list-inside space-y-2 pr-4 mt-4">
            <li>أن هنالك العديد من الحدود الأمنية والشخصية على الشبكة العنكبوتية الخارجة عن مدى سيطرتنا.</li>
            <li>أن أمن وسلامة المعلومات الشخصية والبيانات المتبادلة بين العميل وشركتنا من خلال الموقع لا يمكن ضمانها كاملة، وليس لنا أن نتحمل مسؤولية العبث أو ضياع تلك المعلومات من المستخدم أو أطراف أخرى.</li>
          </ul>
          <div className="mt-4">
            تقوم الشركة بتبليغ المستخدم بأسرع وقت ممكن في حالة إعتقاد الشركة بأن معلوماتك الشخصية التي بحوزتنا تم اختراقها، حيث سنقوم بتبليغ العميل من خلال البريد الإلكتروني بناءًا على الموافقة المسبقة منه لاستخدام بريده في حالة حدوث هذا الأمر. إذا كان العميل يرغب في أن تتواصل شركتنا معه باستخدام طرق أخرى، يرجى إرسال رسالة إلى بريدنا الإلكتروني contact@yallacheese.com، وإرفاق معلومات التواصل الخاصة بالعميل داخله.
          </div>

          <p className="mt-8 mb-2">
            8. ملفات تعريف الارتباط:
          </p>
          <div>
            يمكن لموقعنا استخدام ملفات تعريف الارتباط وتكنولوجيا أخرى عندما يقوم المستخدم بتصفح موقعنا، وذلك من أجل تسهيل عملية الاستفادة واستخدام خدماتنا.
          </div>
          <div className="mt-4">
            <strong>ما هي ملفات تعريف الارتباط؟</strong> ملفات تعريف الارتباط هي ملفات نصية صغيرة يقوم الموقع بتخزينها على جهاز المستخدم أو الهاتف الذكي (في حالة استخدام متصفح الهاتف لها) من أجل أن نتعرف على اسم المستخدم الخاص بك لاحقا. تسهل ملفات تعريف الارتباط على المتصفح عملية استخدام الموقع، وتتيح للمواقع الإلكترونية العمل بشكل أسهل وسلس، وتحتفظ بوضع تسجيل دخول المستخدم للمواقع، حيث تتيح له عدم إدخال بياناته في كل مرة.
          </div>
          <div className="mt-4">
            إن هذه الاتفاقية لا تشمل أي استخدام لملفات تعريف الارتباط من قبل شركائنا وشركات الخدمات ومزودي الخدمة. يمكن للمستخدم إبطال أو حذف جميع أنواع ملفات تعريف الارتباط من خلال الدخول إلى خصائص المتصفح الذي يستخدمه. الرجاء زيارة موقع www.allaboutcookies.org من أجل أي معلومات تتعلق بملفات تعريف الارتباط.
          </div>

          <p className="mt-8 mb-2">
            10. الروابط الخاصة بمواقع أخرى والإعلانات على موقع Yallacheese:
          </p>
          <div>
            كما تم مناقشته من خلال هذه الاتفاقية، تشير هذه الوثيقة فقط لشروط استخدام والإفصاح عن المعلومات التي تقوم شركتنا بجمعها من العميل. يمكن لموقعنا أن يحتوي على روابط خاصة تعود لشركات ومواقع إلكترونية أخرى، يمكن لها جمع البيانات والإفصاح عنها بطريقة تختلف عن موقعنا. لا تتحمل Yallacheese مسؤولية جمع واستخدام المعلومات من تلك الأطراف، ونرفض تحميلنا مسؤولية جمع واستخدام تلك المعلومات أو الإفصاح عنها.
          </div>

          <p className="mt-8 mb-2">
            11. التحديثات الحاصلة على اتفاقية خصوصية المستخدم:
          </p>
          <div>
            في حالة توفر تحديثات جديدة على اتفاقية خصوصية المستخدم، سنقوم بتوفيرها على هذه الصفحة (ستقوم الشركة بوضع منشور خاص على الصفحات الرسمية الخاصة بمواقعنا). وقد تقوم الشركة بتبليغ عملائها عن طريق البريد الإلكتروني الرئيسي الذي قاموا بتزويده لنا في حالة وجود تحديثات على طريقة معاملة بيانات المستخدمين.
          </div>

          <p className="mt-8 mb-2">
            12. المنتديات وغرف المحادثة ورسائل الموقع:
          </p>
          <div>
            في حالة قيام المستخدم بالإفصاح عن أي معلومات خاصة معرفة به في المنتديات وغرف المحادثة ورسائل الموقع المتاحة على المواقع، يتوجب عليه معرفة أن تلك البيانات يمكن أن تجمع وتستخدم من قبل أطراف أخرى، ويمكن أن ينتج عنها رسائل غير مرغوب بها من تلك الأطراف، إذ أن المستخدم هو المسئول عن أية نشاطات يقوم بها على المنتديات وغرف المحادثة ورسائل الموقع وغيرها. الرجاء من العميل العزيز أخذ الحيطة والحذر عند تصفح الشبكة العنكبوتية.
          </div>

          <p className="mt-8 mb-2">
            13. كيفية التواصل مع الموقع من أجل الاستفسارات؟
          </p>
           <div className="mb-20">
            في حالة وجود أسئلة حول اتفاقية خصوصية المستخدم أو طرق تعامل المستخدم مع موقعنا، يرجى إرسال رسالة لنا بعنوان (الرجاء التواصل معنا) على البريد الإلكتروني 
            <a 
              href="mailto:contact@yallacheese.com"
              className="text-primary underline hover:text-[#FF2B77] transition-colors duration-200 mx-1"
            >
              contact@yallacheese.com
            </a>.
          </div>
        </div>
        <Footer />
      </section>
    </div>
  );
}